package com.sixsixsix516.fakeuser.wrapper.realname;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;
import java.util.stream.Collectors;

/**
 * 真实用户名的信息
 */
public interface Constant {

    String[] firstName = new String[]{
            "赵", "钱", "孙", "李", "周", "吴", "郑", "王",
            "冯", "陈", "褚", "卫", "蒋", "沈", "韩", "杨",
            "朱", "秦", "尤", "许", "何", "吕", "施", "张",
            "孔", "曹", "严", "华", "金", "魏", "陶", "姜",
            "戚", "谢", "邹", "喻", "柏", "水", "窦", "章",
            "云", "苏", "潘", "葛", "奚", "范", "彭", "郎",
            "鲁", "韦", "昌", "马", "苗", "凤", "花"
    };

    String[] lastName = new String[]{
            "英", "华", "玉", "秀", "文", "明", "兰", "金", "国", "春", "霞", "敏", "军", "丽", "强", "平", "刚", "芳", "桂", "英",
            "磊", "艳", "涛", "超", "娜", "静", "博", "涵", "浩", "气", "歌", "瀚", "苍", "顺", "悦", "济", "弘", "致", "壮", "远",
            "峻", "逸", "义", "德", "晗", "昱", "日", "畅", "涤", "亮", "忍", "容", "润", "煦", "蓄", "衍", "意", "映", "育", "翰",
            "采", "池", "飞", "海", "翮", "林", "墨", "学", "音", "玥", "藻", "漠", "昊", "空", "乾", "穹", "然", "天", "焱", "波",
            "初", "大", "宕", "荡", "广", "涆", "慨", "旷", "阔", "漫", "淼", "渺", "邈", "穰", "壤", "思", "言", "皓", "轩", "和",
            "蔼", "安", "璧", "昶", "风", "光", "洽", "惬", "硕", "颂", "泰", "悌", "通", "同", "雅", "宜", "怡", "裕", "豫", "韵",
            "泽", "正", "志", "鹤", "方", "厚", "化", "量", "深", "盛", "图", "伟", "新", "扬", "业", "益", "毅", "懿", "宏", "伯",
            "才", "达", "放", "富", "浚", "恺", "朗", "茂", "儒", "胜", "爽", "鸿", "宝", "彩", "畴", "福", "晖", "熙", "羲", "禧",
            "信", "煊", "雪", "羽", "云", "运", "哲", "祯", "振", "卓", "奥", "灿", "藏", "辉", "美", "清", "荣", "嘉", "赐", "良",
            "木", "慕", "纳", "年", "庆", "瑞", "石", "实", "树", "澍", "祥", "歆", "许", "勋", "谊", "颖", "佑", "誉", "珍", "坚",
            "白", "壁", "秉", "成", "诚", "建", "柏", "本", "弼", "茗", "修", "元", "章", "中", "健", "鑫", "锦", "程", "瑾", "瑜",
            "晋", "鹏", "经", "赋", "亘", "略", "纶", "纬", "武", "艺", "景", "澄", "焕", "龙", "山", "铄", "曜", "靖", "琪", "君",
            "俊", "艾", "拔", "材", "驰", "楚", "发", "豪", "杰", "捷", "郎", "力", "迈", "民", "名", "楠", "能", "人", "悟", "晤",
            "侠", "贤", "雄", "彦", "友", "语", "喆", "智", "季", "萌", "江", "沅", "曦", "向", "晨", "笛", "阳", "翔", "宇", "项",
            "禹", "晓", "心", "水", "欣", "可", "怿", "霁", "觉", "立", "知", "鸥", "兴", "邦", "昌", "朝", "怀", "生", "腾", "旺",
            "为", "星", "辰", "汉", "河", "火", "剑", "津", "阑", "雨", "渊", "洲", "洁", "谨", "筠", "齐", "永", "真", "竹", "旭",
            "尧", "炫", "松", "峰", "惜", "夏", "菡", "岚", "青", "彤", "旋", "绮", "姝", "月", "雰", "影", "赩", "湘", "香", "馨",
            "卉", "燕", "莉", "凡", "曼", "霜", "笑", "寒", "愫", "宁", "琴", "柔", "蕊", "娴", "红", "螺", "虹", "慧", "巧", "诺",
            "梅", "愉", "跃", "合", "蕾"
    };

}
